Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Dreaming Freedom.tmx
Source language: en
Languages: es_419

source: pfft
es_419: PFF

source: the pain felt so real that I collapsed...
es_419: EL DOLOR FUE TAN INTENSO QUE ME DESMAYÉ…

source: why does he even come home if he’s just going to get angry...
es_419: NO ENTIENDO POR QUÉ VIENE A CASA SI SE VA A ENFADAR…

source: does she think she’s somebody just because I said a couple of nice things to her?
es_419: ¿CREE QUE ES ALGUIEN IMPORTANTE SOLO PORQUE LE DIJE UN PAR DE COSAS AMABLES?

source: aaah
es_419: AHHHH

source: there might be something else they want from you.
es_419: QUIZÁS QUIERAN OTRA COSA DE TI.

source: ah, jeez...
es_419: BUENO…

source: the girls who had participated in the beating with me...
es_419: LAS OTRAS CHICAS QUE HABÍAN PARTICIPADO DE LA GOLPIZA…

source: is it okay if we go with her?
es_419: ¿ESTÁ BIEN SI VAMOS CON ELLA?

source: right now?
es_419: ¿AHORA?

source: look at her, she’s all alone.
es_419: ESTÁ COMPLETAMENTE SOLA.

source: how much longer do I have to keep avoiding her?
es_419: ¿POR CUÁNTO TIEMPO MÁS TENGO QUE EVITARLA?

source: but still, I don’t want to see her...
es_419: DE TODAS FORMAS, NO QUIERO VERLA…

source: I realized that I’d misjudged where my place was.
es_419: AHORA SÉ QUE MALINTERPRETÉ TODO.

source: ...the girl that jeongmin hates the most...
es_419: LA CHICA QUE MÁS ODIA JEONGMIN.

source: ...but I’m disappointed in you, hyejin.
es_419: PERO ME DECEPCIONASTE, HYEJIN.

source: but you told the other kids about it without even batting an eye.
es_419: PERO TÚ SE LO DIJISTE A TODOS COMO SI NADA.

source: we need to talk.
es_419: TENEMOS QUE HABLAR.

source: learn how to read the room...
es_419: DATE CUENTA DE LA SITUACIÓN…

source: just don’t get curious about me at all.
es_419: NO INTENTES AVERIGUAR NADA SOBRE MÍ.

source: please... just once...
es_419: POR FAVOR… SOLO ESTA VEZ…

source: did you bring mascara?
es_419: ¿TRAJISTE RÍMEL?

source: you’re so lucky you’re an only child!
es_419: ¡QUÉ SUERTE TIENES DE SER HIJA ÚNICA!

source: are you having fun now that you finally have friends again?
es_419: ¿LA PASAS BIEN AHORA QUE TIENES AMIGAS DE NUEVO?

source: did something like that really exist?
es_419: ¿EN SERIO EXISTIÓ ALGO ASÍ?

source: he’s fine...?
es_419: ¿ESTÁ BIEN…?

source: ha
es_419: JA

source: sigh... is this a side effect of lucid dreaming?
es_419: UFF… ¿ESTO SERÁ POR LOS SUEÑOS LÚCIDOS?

source: attention.
es_419: ATENCIÓN.

source: the feelings I’d suppressed for so long were becoming difficult to control.
es_419: LOS SENTIMIENTOS QUE HABÍA SUPRIMIDO DURANTE TANTO TIEMPO AHORA ERAN DIFÍCILES DE CONTROLAR.

source: yeah! haven’t you noticed it too, jeongmin?
es_419: ¡SÍ! ¿NO TE DISTE CUENTA, JEONGMIN?

source: yeah.
es_419: SÍ.

source: are you going out for dinner today?
es_419: ¿HOY SALDRÁS A CENAR?

source: chatter
es_419: BLABLA

source: ...do I want to hear from her...?
es_419: … QUIERO QUE ME DIGA…?

source: why are you helping me?
es_419: ¿POR QUÉ ME AYUDARÍAS?

source: come here!
es_419: ¡VEN!

source: one can control everything in a lucid dream...
es_419: UNO PUEDE CONTROLAR TODO EN SU SUEÑO LÚCIDO…

source: really?
es_419: ¿EN SERIO?

source: he’s so unpredictable!
es_419: ¡ES TAN IMPREDECIBLE!

source: well, juhyeon has decent grades and good leadership, so she’d probably do well.
es_419: BUENO, JUHYEON TIENE BUENAS NOTAS Y ES BUENA LÍDER. CREO QUE ES UNA GRAN CANDIDATA.

source: yet another class where we have to work in pairs.
es_419: OTRA CLASE EN LA QUE TRABAJAMOS EN PAREJA.

source: I can’t believe our last class is gym.
es_419: NO PUEDO CREER QUE LA ÚLTIMA CLASE SEA GIMNASIA.

source: what...
es_419: ¿QUÉ…

source: I just felt like we should watch what we say around her if it’s true
es_419: SI LLEGA A SER CIERTO, CREO QUE DEBERÍAMOS TENER CUIDADO CON LO QUE DECIMOS FRENTE A ELLA

source: why do people with nothing to do care so much about what other people are doing?
es_419: ¿POR QUÉ LA GENTE QUE NO TIENE NADA QUE HACER SE FIJA TANTO EN LO QUE HACEN OTROS?

source: do you understand how awkward it is being between the two of them?
es_419: ¿TIENES IDEA DE LO INCÓMODO QUE ES ESTAR ENTRE ELLAS DOS?

source: so why...
es_419: ENTONCES…

source: everyone keeps spreading false rumors without knowing anything...
es_419: TODOS CREAN RUMORES FALSOS SIN SABER NADA…

source: chirp
es_419: PÍO

source: what do you think I feel when I look at you?
es_419: ¿CÓMO CREEN QUE ME SIENTO YO CUANDO LAS VEO A USTEDES?

source: so it’s just you and your parents?
es_419: ¿SOLO VIVES CON TUS PADRES, ENTONCES?

source: I won’t say I’ll help you, since you hate it so much.
es_419: NO TE OFRECERÉ AYUDA, YA QUE NO TE GUSTA.

source: what do you mean?
es_419: ¿A QUÉ TE REFIERES?

source: but doesn’t it seem like it’s coming from one place in particular?
es_419: PERO PARECE QUE VIENE DE UN LUGAR EN PARTICULAR, ¿NO?

source: are you fucking kidding me?
es_419: ¿ESTÁS LOCA O QUÉ?

source: is it over...?
es_419: ¿TERMINÓ…?

source: hyejin and juhyeon?
es_419: ¿HYEJIN Y JUHYEON?

source: juhyeon started acting weird since she saw jeongmin.
es_419: JUHYEON COMENZÓ A ACTUAR RARO DESDE QUE VIO A JEONGMIN.

source: shove
es_419: MUESTRA

source: well... you were fooled by her too, so I won’t blame you for it.
es_419: BIEN… VEO QUE TAMBIÉN TE ENGAÑÓ A TI, POR ESO NO TE CULPO.

source: slip
es_419: TAC

source: what, she didn’t have a lock pattern?
es_419: ¿NO TIENE UN PATRÓN DE BLOQUEO?

source: hey, you’re going to make her cry, haha.
es_419: EH, VAS A HACERLA LLORAR. JA, JA.

source: hey, you.
es_419: AH, HOLA.

source: wanna see? this is a new drink they have!
es_419: ¿QUIERES VER? ¡TIENEN UNA NUEVA BEBIDA GENIAL!

source: why are you so obsessed with hearing about my life?!
es_419: ¡¿POR QUÉ TIENES TANTAS GANAS DE SABER SOBRE MI VIDA?!

source: she seems different...
es_419: LA VEO DIFERENTE…

source: jeez, I knew you’d do this again, sora.
es_419: CIELOS, SABÍA QUE HARÍAS ESTO DE NUEVO, SORA.

source: I think she overheard us...
es_419: QUIZÁS NOS ESCUCHÓ…

source: you sound like eunju.
es_419: TE PARECES A EUNJU.

source: pathetic
es_419: PATÉTICA

source: what?! what about our promo?!
es_419: ¿QUÉ? ¡¿Y NUESTRA PROMO?!

source: apparently she beat her classmate’s face into a pulp.
es_419: CREO QUE DESFIGURÓ A GOLPES A ALGUIEN DE SU CLASE.

source: slide
es_419: GIRA

source: I bet she has no friends.
es_419: APUESTO A QUE NO TIENE AMIGAS.

source: I should just stop...
es_419: DEBERÍA DEJAR DE HACERLO…

source: I could have summoned him subconsciously...
es_419: QUIZÁS LO LLAMÉ SIN QUERER…

source: I get like that sometimes too.
es_419: YO TAMBIÉN ME PONGO MAL A VECES.

source: it’s humiliating.
es_419: ES HUMILLANTE.

source: whatever, I hope she hears us.
es_419: NO IMPORTA. OJALÁ NOS ESCUCHE.

source: she just has bad vibes... like eunju.
es_419: TIENE UNA MALA ENERGÍA… COMO EUNJU…

source: I bet he regrets acting friendly towards me...
es_419: APUESTO A QUE SE ARREPINTIÓ DE SER AMABLE CONMIGO…

source: what could I even say when I know everyone is on juhyeon’s side?
es_419: ¿QUÉ LE VOY A DECIR SI TODOS EN EL SALÓN ESTÁN DE SU LADO?

source: everyone, pair up and get in line.
es_419: BUSQUEN UNA PAREJA Y FORMEN FILA.

source: hey, how come you didn’t even pretend to notice when I came?
es_419: OYE, ¿POR QUÉ NO TE DISTE NI CUENTA DE QUE LLEGUÉ?

source: alright, that’s all for today.
es_419: BIEN, ESO ES TODO POR HOY.

source: birds of a feather flock together, I guess.
es_419: DIME CON QUIÉN ANDAS Y TE DIRÉ QUIÉN ERES...

source: number 1, collect everyone’s notebooks in number order after class, alright?
es_419: NÚMERO 1, JUNTA LOS CUADERNOS DE TODOS EN ORDEN DESPUÉS DE CLASES.

source: I was honestly kind of relieved.
es_419: … ME SENTÍ BASTANTE ALIVIADA, EN SERIO.

source: lmaooooo this is so ridiculous all i can do is laugh... who cares about my skirt? it’s not like she’s older than me, we’re the same age lol
es_419: JAAAAAAAAAA ES TAN RIDÍCULO QUE SOLO PUEDO REÍRME… ¿A QUIÉN LE IMPORTA MI FALDA? ELLA Y YO TENEMOS LA MISMA EDAD, NO ES MÁS GRANDE XD

source: fine... why don’t you end up like juhyeon this time?
es_419: MUY BIEN… ¿QUÉ TAL SI HOY TERMINAS COMO JUHYEON?

source: ha...
es_419: JA…

source: wow...
es_419: VAYA…

source: if not boys, she’s just talking about herself, lol. she has like no social skills
es_419: SI NO ES DE CHICOS, HABLA DE ELLA XD. CERO HABILIDADES SOCIALES

source: do you want to walk home together today?
es_419: ¿QUIERES QUE VOLVAMOS JUNTOS HOY?

source: smirk
es_419: SONRÍE

source: huh? of course we are. why?
es_419: ¿EH? SÍ, ¿POR QUÉ LO PREGUNTAS?

source: you too, eunju!
es_419: ¡TAMBIÉN TÚ, EUNJU!

source: seungha, are you okay?
es_419: ¿ESTÁS BIEN, SEUNGHA?

source: it’s nice to see you smile!
es_419: ¡ME ALEGRA VERTE SONREÍR!

source: I don’t understand the purpose of bringing me to them.
es_419: NO ENTIENDO POR QUÉ SE ACERCARON A MÍ.

source: whoo
es_419: WOOO

source: slump
es_419: PUM

source: oh, right.
es_419: AH, CIERTO.

source: do you want to get something to eat before we go to cram school?
es_419: ¿QUIERES IR A COMER ALGO ANTES DE CLASES?

source: so that means you’re a good person, too.
es_419: LO QUE SIGNIFICA QUE TAMBIÉN ERES BUENA.

source: my face makes you want to kill me?!
es_419: ¡¿TE DAN GANAS DE MATARME ME MIRAS A LA CARA?!

source: so you just wanted to mess with me and make fun of me with your friends?
es_419: ¿SOLO QUERÍAS APROVECHARTE Y BURLARTE DE MÍ CON TUS AMIGAS?

source: she is...
es_419: ESTÁ…

source: yes, would you put in a little work for your classmates this semester?
es_419: SÍ, ¿ESTÁS DISPUESTA A TRABAJAR UN POCO MÁS POR EL BIEN DE TUS COMPAÑERAS ESTE SEMESTRE?

source: we went to a cafe and talked.
es_419: FUIMOS A UN CAFÉ PARA CHARLAR.

source: is he...
es_419: ¿ESTÁ…

source: flop
es_419: PUM

source: I’m not upset. this isn’t about something like my emotions.
es_419: NO ESTOY MOLESTA. NO TIENE NADA QUE VER CON MIS EMOCIONES.

source: jeongmin, you might not know this...
es_419: QUIZÁS NO LO SEPAS, JEONGMIN…

source: I was so excited to finally have a friend.
es_419: ESTABA TAN CONTENTA DE TENER UNA AMIGA.

source: glance
es_419: MIRA

source: why did I have to be number 1?
es_419: ¿POR QUÉ SOY LA NÚMERO 1?

source: your skirt...
es_419: TU FALDA…

source: my school life is f*cked because of you, you know that?!
es_419: ¡POR TU CULPA, MI VIDA EN LA PREPARATORIA ES UNA MIERDA! ¡¿LO SABES?!

source: how did that happen?
es_419: ¿QUÉ PASÓ?

source: i-it’s okay... it’s not too late yet...
es_419: ESTÁ BIEN… AÚN NO ES DEMASIADO TARDE.

source: haha
es_419: JAJA

source: sorry we went without you...
es_419: ME DA PENA HABER IDO SIN TI…

source: even though she bullied me, I--
es_419: AUNQUE ME HIZO BULLYING, YO…

source: did I mishear that...?
es_419: ¿ESCUCHÉ MAL…?

source: it’s too soon for you to be this surprised...
es_419: ES DEMASIADO PRONTO PARA QUE TE SORPRENDAS…

source: we’ve been running into each other a lot.
es_419: NOS ENCONTRAMOS MUCHO ÚLTIMAMENTE.

source: I was just thinking about the past...
es_419: SOLO RECORDABA EL PASADO…

source: but later, he called and got mad at me because he lost.
es_419: PERO DESPUÉS ME LLAMÓ ENOJADO PORQUE PERDIÓ.

source: it’s fine... how could someone like me ever expect to talk to a boy normally?
es_419: ESTÁ BIEN… ¿POR QUÉ PENSÉ QUE ALGUIEN COMO YO PODRÍA HABLAR NORMALMENTE CON UN CHICO?

source: um...
es_419: EH…

source: stop looking at us!
es_419: ¡DEJA DE MIRARNOS!

source: it’s time. go back now.
es_419: YA ES HORA. VUELVE.

source: I’ll pay you back tomorrow!
es_419: ¡TE PAGARÉ MAÑANA!

source: what a waste.
es_419: QUÉ DESPERDICIO.

source: first...
es_419: PRIMERO…

source: you’ll never be able to forget it.
es_419: NUNCA LA OLVIDARÁS.

source: n-no...
es_419: NO, NO…

source: as we promised, our relationship developed into one where we walked home together.
es_419: COMO PROMETIMOS, NUESTRA RELACIÓN CRECIÓ, Y COMENZAMOS A VOLVER A CASA JUNTOS TODOS LOS DÍAS.

source: seungha gwon (17) sora’s friend
es_419: SEUNGHA GWON (17), AMIGA DE SORA

source: you’ve never regretted what you’ve done.
es_419: NUNCA TE ARREPENTISTE DE LO QUE HICISTE.

source: does that make any sense?
es_419: ESO NO TIENE SENTIDO.

source: those two have been friends since grade school.
es_419: ELLAS SON AMIGAS DESDE LA PRIMARIA.

source: why is that on your phone...?
es_419: ¿POR QUÉ TIENES ESO EN EL CELULAR?

source: hold on, i’ll bring back some juicy gossip lmao
es_419: ESPEREN, VOY A BUSCAR ALGUNOS CHISMES JEJE XD

source: did you get to school?
es_419: ¿FUISTE A LA ESCUELA?

source: who knows? maybe some new people will make your life difficult.
es_419: ¿QUIÉN SABE? TAL VEZ APAREZCA GENTE NUEVA A COMPLICARTE LA VIDA.

source: if you keep living like that, you’ll become a social outcast as an adult, you know.
es_419: SI SIGUES VIVIENDO ASÍ, CUANDO CREZCAS, SERÁS UNA MARGINADA.

source: jeongmin, let’s go inside!
es_419: ¡VOLVAMOS, JEONGMIN!

source: hah
es_419: JA

source: I thought of you two as real friends.
es_419: LAS CONSIDERÉ MIS AMIGAS.

source: why would she make you feel bad when you didn’t do anything?
es_419: ¿POR QUÉ TE HACE SENTIR MAL SI NO HICISTE NADA MALO?

source: you don’t know anything...
es_419: NO SABEN NADA…

source: scramble
es_419: MURMULLO

source: hi, jeongmin. what’s up?
es_419: HOLA, JEONGMIN. ¿QUÉ SUCEDE?

source: ugh, look at your face. it just makes me want to kill you.
es_419: UFF, MÍRATE. CUANDO TE MIRO A LA CARA, ME DAN GANAS DE MATARTE.

source: this is so annoying.
es_419: NO QUIERO HACERLO.

source: if you keep talking to him, you’ll see what a total loser he is
es_419: SI SIGUES HABLANDO CON ÉL, VERÁS QUE ES UN PERDEDOR

source: if she knew that they knew each other,
es_419: SI SUPIERA QUE SE CONOCEN,

source: hey, he looked handsome from what I saw!
es_419: ¡PARECÍA UN CHICO MUY APUESTO!

source: she doesn’t like typical school bullies because she thinks they’re pathetic and gave up on life...
es_419: NO LE CAEN BIEN LAS BRABUCONAS CLÁSICAS PORQUE CREE QUE SON PATÉTICAS Y NO LES IMPORTA NADA…

source: why is he suddenly showing off?
es_419: ¿POR QUÉ AHORA ALARDEA DE ESO?

source: I’m dating juhyeon.
es_419: ESTOY SALIENDO CON JUHYEON.

source: I’m not sure, but sora and I would sometimes talk about jeongmin.
es_419: NO LO SÉ, PERO SORA Y YO A VECES HABLÁBAMOS DE JEONGMIN.

source: a rift would naturally occur...
es_419: NATURALMENTE HABRÍA UNA BRECHA…

source: I’m curious...
es_419: QUIERO SABER…

source: hang out with her and forget about what happened.
es_419: SAL CON ELLA Y OLVÍDATE DE LO QUE PASÓ.

source: I don’t know...
es_419: NO LO SÉ…

source: life is worth living these days, isn’t it?
es_419: AHORA SÍ VALE LA PENA VIVIR, ¿NO?

source: h-huh?
es_419: ¿EH?

source: I wasn’t staying still because I was used to being tormented.
es_419: NO ME QUEDÉ TRANQUILA PORQUE ESTOY ACOSTUMBRADA A QUE ME HAGAN LA VIDA IMPOSIBLE…

source: frantic
es_419: ALTERADA

source: Room C (6)
es_419: SALA C (6)

source: I ended junior high peacefully...
es_419: LA SECUNDARIA TERMINÓ BIEN…

source: do you know that you’re always really rude?
es_419: ¿POR QUÉ SIEMPRE ERES TAN IRRESPETUOSA?

source: she said I’d become a social outcast as an adult.
es_419: DIJO QUE, CUANDO SEA MÁS GRANDE, SERÍA UNA MARGINADA.

source: you’re just bragging that you have a boyfriend!
es_419: ¡SOLO ESTÁS ALARDEANDO DE QUE TIENES NOVIO!

source: what should I do... can I really tell her this...?
es_419: ¿QUÉ HAGO…? ¿PUEDO CONTARLE ESTO…?

source: huh? no, he’s just--
es_419: ¿EH? NO, SOLO ES…

source: don’t we have to pick candidates and vote?
es_419: ¿NO DEBERÍAMOS ELEGIR CANDIDATOS Y VOTAR?

source: all right?
es_419: ¿ESTÁ BIEN?

source: I guess jeongmin really doesn’t consider me a friend...
es_419: CREO QUE JEONGMIN NO ME CONSIDERA SU AMIGA…

source: aren’t you hungry? let’s go to the snack shop.
es_419: ¿TIENES HAMBRE? VAMOS A COMPRAR ALGO.

source: ...it’s your turn to answer mine.
es_419: … ES HORA DE QUE TÚ RESPONDAS LA MÍA.

source: I asked what happened with you and jeongmin.
es_419: TE PREGUNTÉ QUÉ PASÓ ENTRE JEONGMIN Y TÚ.

source: where did you get hurt?
es_419: ¿DÓNDE TE LASTIMASTE?

source: art/story 2L coloring assistance kk
es_419: ARTE/HISTORIA DE 2L AYUDA CON EL COLOR KK

source: I never knew you were so evil!
es_419: ¡NO PENSÉ QUE ERAS TAN MALA!

source: how could you do this to me?
es_419: ¿CÓMO PUDIERON HACERME ESTO?

source: when I see people with no conscience act like they care about other people...
es_419: CUANDO VEO QUE GENTE EGOÍSTA HACE DE CUENTA QUE LE IMPORTAN LOS DEMÁS…

source: ...and my mom returned to her old warm self...
es_419: … Y MI MAMÁ VOLVIÓ A SER LA MUJER CÁLIDA…

source: pfft, she didn’t realize that I set her account to public and she just keeps posting.
es_419: NO SE DIO CUENTA DE QUE CONFIGURÉ SU CUENTA COMO PÚBLICA Y SIGUE PUBLICANDO COSAS.

source: I was so shocked that I forgot I was dreaming...
es_419: QUEDÉ TAN SORPRENDIDA QUE ME OLVIDÉ DE QUE ESTABA SOÑANDO…

source: what are you staring at?
es_419: ¿QUÉ MIRAS?

source: h-hey...!
es_419: ¡OIGAN…!

source: I think we get along really well, right?
es_419: CREO QUE NOS LLEVAMOS BIEN, ¿NO?

source: he’s the one who did this to me and my mom...
es_419: POR CULPA DE ÉL, MAMÁ Y YO ESTAMOS ASÍ…

source: jaehyeok... everything you said is wrong...
es_419: JAEHYEOK… ESTÁS TAN EQUIVOCADO…

source: she said we was going to the bathroom.
es_419: DIJO QUE IBA AL BAÑO.

source: then... you...
es_419: ENTONCES… TÚ…

source: apparently, hyejin and juhyeon haven’t been on the best terms lately.
es_419: PARECE QUE HYEJIN Y JUHYEON NO ESTÁN BIEN ÚLTIMAMENTE.

source: I-I’m not sure.
es_419: N-NO LO SÉ.

source: maybe she’s getting the wrong idea?
es_419: QUIZÁS MALINTERPRETÓ LAS COSAS…

source: that’s why I was harsher to you without realizing it.
es_419: POR ESO FUI DURA CONTIGO SIN DARME CUENTA.

source: looks like you were having an interesting conversation.
es_419: PARECE QUE ESTABAN HABLANDO DE ALGO INTERESANTE.

source: i just
es_419: SOLO

source: whatever, she pissed me off first.
es_419: BAH, QUÉ IMPORTA… ELLA ME HIZO ENFADAR.

source: haha, really??
es_419: JA, JA. ¿SÍ?

source: there’s too much about him that I can’t trust.
es_419: TENGO MUCHOS MOTIVOS PARA NO CONFIAR EN ÉL.

source: what...? it’s not like I don’t pay people back...
es_419: ¿QUÉ…? PERO SIEMPRE PAGO LO QUE DEBO...

source: it’s here.
es_419: AQUÍ ESTÁ.

source: wait, jeongmin bullied you?
es_419: ESPERA. ¿JEONGMIN TE HIZO BULLYING?

source: me too...
es_419: YO TAMBIÉN…

source: were you sleeping in here during gym, too?!
es_419: ¡¿TAMBIÉN ESTABAS DURMIENDO DURANTE LA CLASE DE GIMNASIA?!

source: hey, don’t say that!
es_419: ¡EH! ¡NO DIGAS ESO!

source: See More
es_419: VER MÁS

source: I feel like I’ve seen it before...
es_419: SIENTO QUE YA LO CONOZCO…

source: you always talk like this in situations where you could be nice.
es_419: SIEMPRE ME HABLAS ASÍ CUANDO PODRÍAS SER AMABLE…

source: it’s not them...
es_419: ELLAS NO…

source: all I did was pick up a sticker...
es_419: LO ÚNICO QUE HICE FUE TOMAR UNA PEGATINA DEL SUELO…

source: but she’s not!
es_419: ¡PERO NO LO HACE!

source: y-you made a big deal out of nothing!!
es_419: ¡T-TE PREOCUPAS POR NADA!

source: I thought I was going to be bored to death.
es_419: PENSÉ QUE ME IBA A MORIR DEL ABURRIMIENTO.

source: this is a dream.
es_419: DESPUÉS DE TODO, ES UN SUEÑO.

source: then can you get some information on sora choi for me?
es_419: ¿PUEDES CONSEGUIRME INFORMACIÓN SOBRE SORA CHOI?

source: what a look on her face.
es_419: QUÉ CARA TIENE.

source: yet.
es_419: POR AHORA.

source: keep that in mind...
es_419: RECUÉRDALO…

source: you know I have hella friends other than you, right?
es_419: SABES QUE TENGO MUCHAS AMIGAS, ¿NO?

source: what’s going on?
es_419: ¿QUÉ SUCEDE?

source: has juhyeon still not gotten in touch?
es_419: ¿JUHYEON NO SE COMUNICÓ CONTIGO?

source: I’m even more worried because the atmosphere changed so quickly...
es_419: ME PREOCUPA MUCHO QUE EL AMBIENTE HAYA CAMBIADO TAN DE REPENTE…

source: Account for venting
es_419: CUENTA PARA DESCARGAR

source: that seems like a pretty huge deal.
es_419: PARECE ALGO MUY SERIO.

source: ...isn’t good for a person.
es_419: … NO ES BUENO PARA NADIE.

source: the next day.
es_419: EL DÍA SIGUIENTE

source: would she care...?
es_419: ¿LE IMPORTARÁ…?

source: are we your girlfriends or something? huh?
es_419: ¿SOMOS TUS NOVIAS O ALGO ASÍ? ¿EH?

source: I’m going to go to the bathroom.
es_419: IRÉ AL BAÑO.

source: what the--
es_419: ¡QUÉ MIER…!

source: your dad is on a business trip.
es_419: TU PADRE SE FUE A UN VIAJE DE NEGOCIOS.

source: were you gossiping about me?
es_419: ¿ESTABAN CHISMOSEANDO SOBRE MÍ?

source: don’t ignore me!
es_419: ¡NO ME IGNORES!

source: should we try seeing who’s the bigger piece of shit here?
es_419: ¿QUIERES VER QUIÉN ES LA PEOR BASURA DE TODAS?

source: the semester just started and she’s already memorized everyone’s names.
es_419: RECIÉN EMPIEZA EL SEMESTRE Y YA SE MEMORIZÓ EL NOMBRE DE TODOS.

source: I like you more, so why?
es_419: ME GUSTAS MÁS A MÍ. ¿POR QUÉ?

source: when I got to high school...
es_419: PERO CUANDO LLEGUÉ A LA PREPARATORIA…

source: can we talk...?
es_419: ¿PODEMOS HABLAR…?

source: stop it...
es_419: BASTA…

source: I do...
es_419: SÍ…

source: she’s kind enough to extend mercy to someone like jeongmin.
es_419: Y ES TAN BUENA PERSONA QUE SE APIADÓ DE JEONGMIN.

source: it’s not a good look to think like this now...
es_419: NO ESTÁ BIEN PENSAR EN ESO AHORA…

source: w-well, it was my first time seeing it, but it was pretty cute...
es_419: BUENO, FUE LA PRIMERA VEZ QUE LO VI, PERO ERA TIERNO…

source: don’t I look creepy to him?
es_419: ¿NO LE PAREZCO RARA?

source: One day, a mysterious man enters her dreams and offers to help her get revenge on Juhyeon…
es_419: Un día, un hombre misterioso aparece en sus sueños y le ofrece ayuda para vengarse de Juhyeon...

source: there’s nothing she can do if you cut her off right now!
es_419: SI DEJAS DE JUNTARTE CON ELLA, ¡NO PODRÁ HACER NADA!

source: you’re right.
es_419: TIENES RAZÓN.

source: I have special abilities?
es_419: … TENGO PODERES ESPECIALES?

source: she’s taking me somewhere with no people omg I’m so scared
es_419: ME LLEVA A UN LUGAR DONDE NO HAY NADIE OMG TENGO MIEDO

source: she used one of my weaknesses to make me do whatever she wanted,
es_419: SE APROVECHÓ DE UNA DE MIS DEBILIDADES PARA DECIRME QUÉ HACER.

source: she kept acting like she wasn’t scared of them, haha.
es_419: FINGÍA NO ESTAR ASUSTADA. JA, JA.

source: I just want to escape from this shitty reality...
es_419: SOLO QUIERO HUIR DE ESTA REALIDAD…

source: it’s true.
es_419: ES VERDAD.

source: hmm? come with us!
es_419: ¿EH? ¡ACOMPÁÑANOS!

source: you have me! just hang out with me instead.
es_419: ¡ME TIENES A MÍ! TIENES QUE PASAR TIEMPO SOLO CONMIGO.

source: go to all of your other classes!
es_419: ¡SERÁ MEJOR QUE ASISTAS A TODAS LAS OTRAS CLASES!

source: she’s starting to not react...
es_419: NO ESTÁ REACCIONANDO…

source: by the way, it looks like your school life has gotten a lot better after threatening sora!
es_419: POR CIERTO, ¡PARECE QUE TU VIDA ESCOLAR MEJORÓ MUCHO DESDE QUE AMENAZASTE A SORA!

source: backing up
es_419: RETROCEDE

source: cut the crap.
es_419: NO TE HAGAS LA TONTA.

source: I was starting to get bored of her because she wasn’t reacting these days.
es_419: ÚLTIMAMENTE ME ESTABA ABURRIENDO PORQUE YA NO REACCIONABA A NADA.

source: it’s really nice to see you like that!
es_419: ¡ES BUENO VERTE ASÍ!

source: I felt bad that you were stuck in that kind of predicament...
es_419: ME DIO PENA QUE ESTUVIERAS ATASCADA EN ESE PROBLEMA…

source: i know I did that but this isn’t right lmao
es_419: SÉ QUE HICE ESO, PERO ESTO NO ES JUSTO XD

source: what school does he go to?
es_419: ¿A QUÉ ESCUELA VA?
